# Use by calling brew bundle -v

# Taps
tap "heroku/brew"
tap "thoughtbot/formulae"

# Brews
brew "ansible"
brew "bat"
brew "ctags"
brew "diff-so-fancy"
brew "elm"
brew "exercism"
brew "fish"
brew "git"
brew "github/gh/gh"
brew "heroku"
brew "htop"
brew "mas"
brew "mtr"
brew "neovim"
brew "nmap"
brew "nodenv"
brew "postgresql"
brew "prettyping"
brew "pyenv"
brew "rbenv"
brew "rcm"
brew "tmux"
brew "tree"

# Casks
cask "1password"
cask "avast-security"
cask "balenaetcher"
cask "bartender"
cask "cncnet"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "fork"
cask "github"
cask "gog-galaxy"
cask "insomnia"
cask "jetbrains-toolbox"
cask "kindle"
cask "little-snitch"
cask "macdown"
cask "parallels"
cask "postman"
cask "steam"
cask "sketch"
cask "homebrew/cask-drivers/sonos"
cask "spectacle"
cask "spotify"
cask "superduper"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "yubico-authenticator"
