# Use by calling brew bundle -v

# Taps
tap "heroku/brew"
tap "thoughtbot/formulae"

# Brews
brew "ansible"        # Manage machines/dependencies
brew "bat"            # Better cat
brew "diff-so-fancy"  # Better diff
brew "elm"            # Functional web development
brew "exa"            # Fancier ls (also used for tree)
brew "exercism"       # Programming exercises
brew "fish"           # Better prompt
brew "git"            # Source control
brew "github/gh/gh"   # Github cli tool
brew "heroku"         # Heroku cli tool
brew "htop"           # Better top
brew "mas"            # Manage app store installs
brew "mtr"            # Better traceroute
brew "neovim"         # Better vim
brew "nmap"           # Port scanning
brew "nodenv"         # Manage node environments
brew "postgresql"     # Database server
brew "prettyping"     # Better ping
brew "pyenv"          # Manage python environments
brew "rbenv"          # Manage ruby environments
brew "rcm"            # Manage dotfiles
brew "starship"       # Prompt
brew "tmux"           # Better terminal

# Casks
cask "1password"
cask "avast-security"
cask "balenaetcher"
cask "bartender"
cask "cncnet"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "fork"
cask "github"
cask "gog-galaxy"
cask "insomnia"
cask "jetbrains-toolbox"
cask "kindle"
cask "little-snitch"
cask "macdown"
cask "parallels"
cask "postman"
cask "steam"
cask "sketch"
cask "homebrew/cask-drivers/sonos"
cask "spectacle"
cask "spotify"
cask "superduper"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "yubico-authenticator"
