# Use by calling brew bundle -v

# Taps
tap "heroku/brew"
tap "thoughtbot/formulae"
tap "homebrew/cask-drivers"

# Brews
brew "bat"            # Better cat
brew "ctags"          # Language tags
brew "diff-so-fancy"  # Better diff
brew "elm"            # Functional web development
brew "entr"           # Auto-run on file changes
brew "exa"            # Fancier ls (also used for tree)
brew "exercism"       # Programming exercises
brew "fish"           # Better prompt
brew "fzf"            # Fuzzies
brew "git"            # Source control
brew "gh"             # Github cli tool
brew "gpatch"         # Opam dependency
brew "heroku"         # Heroku cli tool
brew "htop"           # Better top
brew "mas"            # Manage app store installs
brew "mtr"            # Better traceroute
brew "neovim"         # Better vim
brew "nmap"           # Port scanning
brew "nodenv"         # Manage node environments
brew "opam"           # OCaml
brew "postgresql"     # Database server
brew "prettyping"     # Better ping
brew "pyenv"          # Manage python environments
brew "rbenv"          # Manage ruby environments
brew "rcm"            # Manage dotfiles
brew "ripgrep"        # Fast search
brew "starship"       # Prompt
brew "tmux"           # Better terminal
brew "whalebrew"      # Install dependencies with docker

# Casks
cask_args appdir: "~/Applications"
cask "1password"
cask "balenaetcher"
cask "bartender"
cask "cncnet"
cask "docker"
cask "dropbox"
cask "expressvpn"
cask "firefox"
cask "flux"
cask "github"
cask "gitup"
cask "gog-galaxy"
cask "inkscape"
cask "insomnia"
cask "kindle"
cask "little-snitch"
cask "macdown"
cask "malwarebytes"
cask "notion"
cask "parallels"
cask "postman"
cask "sonos"
cask "steam"
cask "sketch"
cask "spectacle"
cask "spotify"
cask "steam"
cask "superduper"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "yubico-authenticator"
cask "Zettlr"

# Mac App Store
mas "Tailscale", id: 1475387142
mas "Things", id: 904280696
mas "Pixelmator", id: 407963104
mas "Xcode", id: 497799835
